app/Controllers/Form.php

    public function listing()
    {
        $formModel = new FormModel();
        $sectionModel = new SectionModel();

        $forms = $formModel
            ->orderBy('name', 'ASC')
            ->findAll();

        foreach ($forms as &$form) {
            $form['section_count'] = $sectionModel
                ->where('form_id', $form['id'])
                ->countAllResults();
---
SELECT *
FROM `forms`
ORDER BY `name` ASC
SELECT COUNT(*) AS `numrows`
FROM `sections`
WHERE `form_id` = '12'

    public function index($formKey = 'accuracyform')
    {

        // return "coming";
        $formModel = new FormModel();
        $sectionModel = new SectionModel();

        // 1. Get form
        $form = $formModel->where('form_key', $formKey)->first();



        if (!$form) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }


        // 2. Check composite
        $db = \Config\Database::connect();

        // return $db;

        $childIds = $db->table('form_compositions')
            ->select('child_form_id')
            ->where('parent_form_id', $form['id'])
            ->orderBy('order')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `forms`
WHERE `form_key` = 'accuracyform'
 LIMIT 1
SELECT `child_form_id`
FROM `form_compositions`
WHERE `parent_form_id` = '44'
ORDER BY `order`