app/Models/SectionModel.php

    public function getSectionsWithFields($formIds)
    {
        $db = \Config\Database::connect();

        $sections = $db->table('sections')
            ->whereIn('form_id', $formIds)
            // Form Builder persists the visible section/subsection sequence in
            // `position`.  `order` is a legacy creation/order value and can
            // remain stale after a builder reorder.
            ->orderBy('position', 'ASC')
            ->orderBy('order', 'ASC')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

        foreach ($sections as &$section) {

            $fields = $db->table('fields')
                ->where('section_id', $section['id'])
                ->orderBy('order')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `fields`
WHERE `section_id` = '94'
ORDER BY `order`